# Data Loading

### Loading a .csv file

In [1]:
import numpy as np
import pandas as pd

In [2]:
data=pd.read_csv("C://Users//avina//Documents//Cyber Square//Data Loading and Cleaning//synthetic_messy_dataset.csv")
data

   ID  Name    Age  Gender Salary Department
0   1   Avi   25.0    Male  50000         HR
1   2   avi    NaN       M  55000         hr
2   2  JOHN  200.0    male  60000    Finance
3   3  Mary   30.0  Female      ?    finance
4   4  mary   -5.0       F  70000    Finance
5   5   Sam   28.0       f  65000         IT
6   6   NaN   40.0       ?    NaN        NaN

In [3]:
# Showing 1st 5 rows
data.head()

   ID  Name    Age  Gender Salary Department
0   1   Avi   25.0    Male  50000         HR
1   2   avi    NaN       M  55000         hr
2   2  JOHN  200.0    male  60000    Finance
3   3  Mary   30.0  Female      ?    finance
4   4  mary   -5.0       F  70000    Finance

In [4]:
# showing last 5 rows
data.tail()

   ID  Name    Age  Gender Salary Department
2   2  JOHN  200.0    male  60000    Finance
3   3  Mary   30.0  Female      ?    finance
4   4  mary   -5.0       F  70000    Finance
5   5   Sam   28.0       f  65000         IT
6   6   NaN   40.0       ?    NaN        NaN

In [5]:
# showing 1st n rows
data.head(3)

   ID  Name    Age Gender Salary Department
0   1   Avi   25.0   Male  50000         HR
1   2   avi    NaN      M  55000         hr
2   2  JOHN  200.0   male  60000    Finance

In [6]:
#showing last n rows
data.tail(2)

   ID Name   Age Gender Salary Department
5   5  Sam  28.0      f  65000         IT
6   6  NaN  40.0      ?    NaN        NaN

## Loading an excel file

In [2]:
df = pd.read_excel("C://Users//avina//Documents//Cyber Square//Data Loading and Cleaning//synthetic_employee_data.xlsx")
df

NameError: name 'pd' is not defined

In [1]:
df.head()

NameError: name 'df' is not defined

In [ ]:
data.tail()

## 2. Initial Data Exploration

After loading, always check the shape and structure:

In [ ]:
df.shape

In [3]:
df.info()

NameError: name 'df' is not defined

In [ ]:
df.describe()

## 3. Data Cleaning Steps

### (a) Handle Duplicates

In [ ]:
df.duplicated()

In [ ]:
df.duplicated().sum()

In [ ]:
print(df.duplicated().sum())

In [ ]:
df[df.duplicated()]

In [ ]:
df.drop_duplicates()

In [ ]:
df=df.drop_duplicates()

In [ ]:
print(df.duplicated().sum())

### (b) Handle Missing Values

In [ ]:
df.isna()

In [ ]:
df.isnull()

In [ ]:
df.isna().sum()

In [ ]:
df.dropna()

In [ ]:
no_na=df.dropna()
no_na.isna().sum()

In [ ]:
df.isna().sum()

In [ ]:
df["Gender"].unique()

In [ ]:
df["Department"].unique()

In [ ]:
df["gender_new"]=df["Gender"].replace({'F':'Female', 'M':"Male"})
df

In [ ]:
df["department_new"]=df["Department"].replace({'finance':'Finance'})
df

In [ ]:
df.head()

In [ ]:
new=df.drop(columns='Gender')
new

In [ ]:
new=new.drop('Department',axis=1)
new

In [ ]:
print(new["Age"].mean())

In [ ]:
new["Age"]=new["Age"].fillna(new["Age"].mean())

In [ ]:
new.isna().sum()

In [ ]:
new["Salary"]=new["Salary"].fillna(new["Salary"].mean())
new.isna().sum()

In [ ]:
new.to_csv("C://Users//avina//Desktop//cleaned_data.csv")